[
  {
    "name": "Tam",
    "feedback": "This case is very protective and even has extra bulk on the corners to protect against a drop. The square around the camera comes out just enough to protect the camera but not be too bulky. Love the little bit of color. FIngerprints do show up but wipe off easily.",
    "score": "5"
  },
  {
    "name": "Maureen Kane",
    "feedback": "The case arrived quickly. It fit perfectly. It looks great. I have only had it a few weeks now. I haven't dropped it - yet. Hopefully, the case keeps the phone safe if I do.",
    "score": "4"
  },
  {
    "name": "Marcieness",
    "feedback": "I love how this feels. It’s plastic but sturdy. I love the colour to accent the side of my phone as I have the",
    "score": "5"
  },
  {
    "name": "Dana Cain",
    "feedback": "This is perfect. Almost like not having a case but with a sense that your phone is protected. I love it.",
    "score": "5"
  },
  {
    "name": "RdRydngHd",
    "feedback": "The new magnetic recharger resists sticking to the back of the phone because of the cover— not all the time, but some of the time. I have to triple-check, and that’s two times too many. I’m on the verge of ditching it, to be honest.",
    "score": "3"
  },
  {
    "name": "Tania D",
    "feedback": "It’s a nice case my only complaint is that I thought this phone case was going to be the hard clear plastic, this one is more flimsy than I hoped for. In the review pictures it looked like the sturdier material. It looks nice but I’m not sure about the durability yet.",
    "score": "3"
  },
  {
    "name": "A. Hopper",
    "feedback": "It’s a fairly stout case for the money. I chose one with a colored border to hide any debris that might get trapped between the sides of the case and phone. However, buyer be warned: the back (main clear part) is a bit tacky in texture (probably for grip), but that causes it to attract other things, especially fingerprints. I had to knock my review down 2 starts because it’s very much fingerprint magnet.",
    "score": "3"
  },
  {
    "name": "Ashli Nicole",
    "feedback": "I’ve had this phone case for 2 months now and haven’t noticed any yellowing like I normally do with clear cases. I love the color it’s subtle enough to have my actual purple phone visible, definitely recommend!",
    "score": "4"
  },
  {
    "name": "Littlebit",
    "feedback": "I’d buy it again. Buy the screen saver separately!",
    "score": "4"
  },
  {
    "name": "LoveReading",
    "feedback": "The phone case is great. I have had the clear case over a year now and it started yellowing at about the 2 year mark. Not bad but would like a replacement as stated in the advertising. I contacted the seller for replacements. Hopefully they honor what is stated in their ad.",
    "score": "4"
  },
  {
    "name": "Karen",
    "feedback": "I bought this case as there was a lot of positive reviews and also based on the description that the case color won’t change to yellow. Also, the description mentioned that it is anti scratch and my case got scratched too! Very disappointed.",
    "score": "2"
  },
  {
    "name": "Okixfer",
    "feedback": "After 31/2 months yellow and turned a pink color. There is no way to contact seller. Hope they see this and honor warranty. Will update. Otherwise a nice sturdy case.",
    "score": "2"
  },
  {
    "name": "Oscar S",
    "feedback": "I have purchased many cases on Amazon and I have never had my cell phone break, ever! I had my previous case for as long as I’ve had my phone and needed to replace it due to yellowing and bought this one, I only had it for about a month and my phone fell from my dresser and the whole back screen cracked. So disappointed and now I have to get my phone repaired.",
    "score": "1"
  },
  {
    "name": "Lisa",
    "feedback": "I have had my phone for two years and have had no problems even with multiple accidental drops. It was just old, scratched and yellowed so I purchased this one. Put the case on this morning, had my phone on my table this evening, it was knocked off 3-4ft and the entire back screen shattered!! I am now left with a broken phone I need to get fixed! Do not purchase! It does NOT work! Did not protect my phone as advertised!",
    "score": "1"
  },
  {
    "name": "Heidi Stehling",
    "feedback": "There is a major problem when the screen OFF button won’t depress properly….then your battery wears down too fast. I can’t stand it when a phone case is supposed to be for a particular model phone but then it doesn’t fit the phone properly and you can’t actually press the button properly to make it function the way it’s supposed to.",
    "score": "1"
  },
  {
    "name": "Tony Li",
    "feedback": "Has been a month now and case is still somewhat clear. Decent case",
    "score": "4"
  },
  {
    "name": "Yeff",
    "feedback": "Fabricado con muy buen material buen gusto al tacto",
    "score": "4"
  },
  {
    "name": "Jean Claude Tadiomi",
    "feedback": "Nice",
    "score": "4"
  },
  {
    "name": "Amanda",
    "feedback": "Just ordered a second one after having the first for 2 years. It yellowed/was dirty so I replaced it. It survived many many drops.",
    "score": "5"
  },
  {
    "name": "Alexandra Tercero",
    "feedback": "I love it",
    "score": "5"
  },
  {
    "name": "Pedro",
    "feedback": "👍🏻👍🏻",
    "score": "5"
  },
  {
    "name": "J. C. L.",
    "feedback": "I replace s an old cover with this new one and it is a great fit and looks good too.",
    "score": "5"
  },
  {
    "name": "KHZ-242",
    "feedback": "I liked the fact that this product was not over sold. It is exactly as the description given states. I’m very pleased with the quality, the fit and look of my iPhone 12 case. Time will tell if it’s as durable & protective as claimed!",
    "score": "5"
  },
  {
    "name": "Letitia Strickland",
    "feedback": "great protection and ease of slipping in and out of a pocket that my previous rubberized protector proved a challenge",
    "score": "5"
  },
  {
    "name": "Sue",
    "feedback": "Haven’t had it long enough and haven’t dropped but it looks and feels just like a more expensive case I bought for last phone",
    "score": "5"
  },
  {
    "name": "Gruntled",
    "feedback": "I bought this for my wife to save money. Her iPhone is in very good condition but she is a somewhat abusive user and the originally installed screen protector and case showed a lot of wear and tear. In her mind, she felt she needed a new phone.",
    "score": "4"
  }
]